tiborsimon/embedded-tdd-headers/pic/pic18/pic18f67k40_tdd.h
#define TX4IF                         522
#define RC4IF                         523
#define TX5IF                         524
#define RC5IF                         525
#define PIR5                          526
#define TMR1IF                        527
#define TMR2IF                        528
#define TMR3IF                        529
#define TMR4IF                        530
#define TMR5IF                        531
#define TMR6IF                        532
#define TMR7IF                        533
#define TMR8IF                        534
#define PIR6                          535
#define TMR1GIF                       536
#define TMR3GIF                       537
#define TMR5GIF                       538
#define TMR7GIF                       539
#define PIR7                          540
#define CCP1IF                        541
#define CCP2IF                        542
#define CCP3IF                        543
#define CCP4IF                        544
#define CCP5IF                        545
#define PIR8                          546
#define NVMIF                         547
#define CRCIF                         548
#define SCANIF                        549
#define PIR9                          550
#define SMU1IF                        551
#define SMU1PRAIF                     552
#define SMU1PWAIF                     553
#define SMU2IF                        554
#define SMU2PRAIF                     555
#define SMU2PWAIF                     556
#define WDTCON0                       557
#define WDTCON0_SEN                   558
#define SWDTEN                        559
#define WDTSEN                        560
#define PS                            561
#define WDTPS                         562
#define WDTPS0                        563
#define PS0                           564
#define WDTPS1                        565
#define PS1                           566
#define WDTPS2                        567
#define PS2                           568
#define WDTPS3                        569
#define PS3                           570
#define WDTPS4                        571
#define PS4                           572
#define WDTCON1                       573
#define WDTWINDOW0                    574
#define WINDOW0                       575
#define WINDOW                        576
#define WDTWINDOW                     577
#define WDTWINDOW1                    578
#define WINDOW1                       579
#define WDTWINDOW2                    580
#define WINDOW2                       581
#define WDTCS                         582
#define WDTCON1_CS0                   583
#define WDTCON1_CS                    584
#define WDTCS0                        585
#define WDTCON1_CS1                   586
#define WDTCS1                        587
#define WDTCON1_CS2                   588
#define WDTCS2                        589
#define WDTL                          590
#define WDT0                          591
#define WDT1                          592
#define WDT2                          593
#define WDT3                          594
#define WDT4                          595
#define WDT5                          596
#define WDT6                          597
#define WDT7                          598
#define WDTH                          599
#define WDT8                          600
#define WDT9                          601
#define WDT10                         602
#define WDT11                         603
#define WDT12                         604
#define WDT13                         605
#define WDT14                         606
#define WDT15                         607
#define WDTU                          608
#define WDTPSCNT16                    609
#define WDT16                         610
#define PSCNT16                       611
#define WDTPSCNT                      612
#define WDTPSCNT17                    613
#define WDT17                         614
#define PSCNT17                       615
#define WDTPSCNT18                    616
#define WDTSTATE                      617
#define PSCNT18                       618
#define WDTPSCNT19                    619
#define WDT18                         620
#define PSCNT19                       621
#define PSCNT20                       622
#define WDT19                         623
#define WDTPSCNT20                    624
#define PSCNT21                       625
#define WDTPSCNT21                    626
#define WDT20                         627
#define PSCNT22                       628
#define WDT21                         629
#define WDTPSCNT22                    630
#define WDT22                         631
#define CPUDOZE                       632
#define DOZE0                         633
#define DOZE                          634
#define DOZE1                         635
#define DOZE2                         636
#define DOE                           637
#define ROI                           638
#define DOZEN                         639
#define IDLEN                         640
#define OSCCON1                       641
#define NDIV0                         642
#define NDIV                          643
#define NDIV1                         644
#define NDIV2                         645
#define NDIV3                         646
#define NOSC0                         647
#define NOSC                          648
#define NOSC1                         649
#define NOSC2                         650
#define OSCCON2                       651
#define CDIV0                         652
#define CDIV                          653
#define CDIV1                         654
#define CDIV2                         655
#define CDIV3                         656
#define COSC                          657
#define COSC0                         658
#define COSC1                         659
#define COSC2                         660
#define OSCCON3                       661
#define NOSCR                         662
#define ORDY                          663
#define SOSCPWR                       664
#define CSWHOLD                       665
#define OSCSTAT                       666
#define PLLR                          667
#define ADOR                          668
#define SOR                           669
#define LFOR                          670
#define MFOR                          671
#define HFOR                          672
#define EXTOR                         673
#define OSCEN                         674
#define ADOEN                         675
#define SOSCEN                        676
#define LFOEN                         677
#define MFOEN                         678
#define HFOEN                         679
#define EXTOEN                        680
#define OSCTUNE                       681
#define TUN0                          682
#define TUN                           683
#define TUN1                          684
#define TUN2                          685
#define TUN3                          686
#define TUN4                          687
#define TUN5                          688
#define OSCFRQ                        689
#define HFFRQ                         690
#define FRQ0                          691
#define FRQ1                          692
#define FRQ2                          693
#define FRQ3                          694
#define VREGCON                       695
#define VREGPM0                       696
#define VREGPM                        697
#define VREGPM1                       698
#define BORCON                        699
#define BORRDY                        700
#define SBOREN                        701
#define PMD0                          702
#define IOCMD                         703
#define CLKRMD                        704
#define SPI1MD                        705
#define SPI2MD                        706
#define NVMMD                         707
#define SCANMD                        708
#define CRCMD                         709
#define HLVDMD                        710
#define FVRMD                         711
#define SYSCMD                        712
#define PMD1                          713
#define EMBMD                         714
#define TMR0MD                        715
#define TMR1MD                        716
#define TMR2MD                        717
#define TMR3MD                        718
#define TMR4MD                        719
#define TMR5MD                        720
#define TMR6MD                        721
#define TMR7MD                        722
#define PMD2                          723
#define TMR8MD                        724
#define SMU1MD                        725
#define SMU2MD                        726
#define DSMMD                         727
#define CWGMD                         728
#define CWG1MD                        729
#define PMD3                          730
#define ZCDMD                         731
#define CMP1MD                        732
#define CMP2MD                        733
#define CMP3MD                        734
#define ADCMD                         735
#define DACMD                         736
#define PMD4                          737
#define CCP1MD                        738
#define CCP2MD                        739
#define CCP3MD                        740
#define CCP4MD                        741
#define CCP5MD                        742
#define PWM6MD                        743
#define PWM7MD                        744
#define PMD5                          745
#define MSSP1MD                       746
#define MSSP2MD                       747
#define UART1MD                       748
#define UART2MD                       749
#define UART3MD                       750
#define UART4MD                       751
#define UART5MD                       752
#define RA0PPS                        753
#define RA0PPS0                       754
#define RA0PPS1                       755
#define RA0PPS2                       756
#define RA0PPS3                       757
#define RA0PPS4                       758
#define RA0PPS5                       759
#define RA1PPS                        760
#define RA1PPS0                       761
#define RA1PPS1                       762
#define RA1PPS2                       763
#define RA1PPS3                       764
#define RA1PPS4                       765
#define RA1PPS5                       766
#define RA2PPS                        767
#define RA2PPS0                       768
#define RA2PPS1                       769
#define RA2PPS2                       770
#define RA2PPS3                       771
#define RA2PPS4                       772
#define RA2PPS5                       773
#define RA3PPS                        774
#define RA3PPS0                       775
#define RA3PPS1                       776
#define RA3PPS2                       777
#define RA3PPS3                       778
#define RA3PPS4                       779
#define RA3PPS5                       780
#define RA4PPS                        781
#define RA4PPS0                       782
#define RA4PPS1                       783
#define RA4PPS2                       784
#define RA4PPS3                       785
#define RA4PPS4                       786
#define RA4PPS5                       787
#define RA5PPS                        788
#define RA5PPS0                       789
#define RA5PPS1                       790
#define RA5PPS2                       791
#define RA5PPS3                       792
#define RA5PPS4                       793
#define RA5PPS5                       794
#define RA6PPS                        795
#define RA6PPS0                       796
#define RA6PPS1                       797
#define RA6PPS2                       798
#define RA6PPS3                       799
#define RA6PPS4                       800
#define RA6PPS5                       801
#define RA7PPS                        802
#define RA7PPS0                       803
#define RA7PPS1                       804
#define RA7PPS2                       805
#define RA7PPS3                       806
#define RA7PPS4                       807
#define RA7PPS5                       808
#define RB0PPS                        809
#define RB0PPS0                       810
#define RB0PPS1                       811
#define RB0PPS2                       812
#define RB0PPS3                       813
#define RB0PPS4                       814
#define RB0PPS5                       815
#define RB1PPS                        816
#define RB1PPS0                       817
#define RB1PPS1                       818
#define RB1PPS2                       819
#define RB1PPS3                       820
#define RB1PPS4                       821
#define RB1PPS5                       822
#define RB2PPS                        823
#define RB2PPS0                       824
#define RB2PPS1                       825
#define RB2PPS2                       826
#define RB2PPS3                       827
#define RB2PPS4                       828
#define RB2PPS5                       829
#define RB3PPS                        830
#define RB3PPS0                       831
#define RB3PPS1                       832
#define RB3PPS2                       833
#define RB3PPS3                       834
#define RB3PPS4                       835
#define RB3PPS5                       836
#define RB4PPS                        837
#define RB4PPS0                       838
#define RB4PPS1                       839
#define RB4PPS2                       840
#define RB4PPS3                       841
#define RB4PPS4                       842
#define RB4PPS5                       843
#define RB5PPS                        844
#define RB5PPS0                       845
#define RB5PPS1                       846
#define RB5PPS2                       847
#define RB5PPS3                       848
#define RB5PPS4                       849
#define RB5PPS5                       850
#define RB6PPS                        851
#define RB6PPS0                       852
#define RB6PPS1                       853
#define RB6PPS2                       854
#define RB6PPS3                       855
#define RB6PPS4                       856
#define RB6PPS5                       857
#define RB7PPS                        858
#define RB7PPS0                       859
#define RB7PPS1                       860
#define RB7PPS2                       861
#define RB7PPS3                       862
#define RB7PPS4                       863
#define RB7PPS5                       864
#define RC0PPS                        865
#define RC0PPS0                       866
#define RC0PPS1                       867
#define RC0PPS2                       868
#define RC0PPS3                       869
#define RC0PPS4                       870
#define RC0PPS5                       871
#define RC1PPS                        872
#define RC1PPS0                       873
#define RC1PPS1                       874
#define RC1PPS2                       875
#define RC1PPS3                       876
#define RC1PPS4                       877
#define RC1PPS5                       878
#define RC2PPS                        879
#define RC2PPS0                       880
#define RC2PPS1                       881
#define RC2PPS2                       882
#define RC2PPS3                       883
#define RC2PPS4                       884
#define RC2PPS5                       885
#define RC3PPS                        886
#define RC3PPS0                       887
#define RC3PPS1                       888
#define RC3PPS2                       889
#define RC3PPS3                       890
#define RC3PPS4                       891
#define RC3PPS5                       892
#define RC4PPS                        893
#define RC4PPS0                       894
#define RC4PPS1                       895
#define RC4PPS2                       896
#define RC4PPS3                       897
#define RC4PPS4                       898
#define RC4PPS5                       899
#define RC5PPS                        900
#define RC5PPS0                       901
#define RC5PPS1                       902
#define RC5PPS2                       903
#define RC5PPS3                       904
#define RC5PPS4                       905
#define RC5PPS5                       906
#define RC6PPS                        907
#define RC6PPS0                       908
#define RC6PPS1                       909
#define RC6PPS2                       910
#define RC6PPS3                       911
#define RC6PPS4                       912
#define RC6PPS5                       913
#define RC7PPS                        914
#define RC7PPS0                       915
#define RC7PPS1                       916
#define RC7PPS2                       917
#define RC7PPS3                       918
#define RC7PPS4                       919
#define RC7PPS5                       920
#define RD0PPS                        921
#define RD0PPS0                       922
#define RD0PPS1                       923
#define RD0PPS2                       924
#define RD0PPS3                       925
#define RD0PPS4                       926
#define RD0PPS5                       927
#define RD1PPS                        928
#define RD1PPS0                       929
#define RD1PPS1                       930
#define RD1PPS2                       931
#define RD1PPS3                       932
#define RD1PPS4                       933
#define RD1PPS5                       934
#define RD2PPS                        935
#define RD2PPS0                       936
#define RD2PPS1                       937
#define RD2PPS2                       938
#define RD2PPS3                       939
#define RD2PPS4                       940
#define RD2PPS5                       941
#define RD3PPS                        942
#define RD3PPS0                       943
#define RD3PPS1                       944
#define RD3PPS2                       945
#define RD3PPS3                       946
#define RD3PPS4                       947
#define RD3PPS5                       948
#define RD4PPS                        949
#define RD4PPS0                       950
#define RD4PPS1                       951
#define RD4PPS2                       952
#define RD4PPS3                       953
#define RD4PPS4                       954
#define RD4PPS5                       955
#define RD5PPS                        956
#define RD5PPS0                       957
#define RD5PPS1                       958
#define RD5PPS2                       959
#define RD5PPS3                       960
#define RD5PPS4                       961
#define RD5PPS5                       962
#define RD6PPS                        963
#define RD6PPS0                       964
#define RD6PPS1                       965
#define RD6PPS2                       966
#define RD6PPS3                       967
#define RD6PPS4                       968
#define RD6PPS5                       969
#define RD7PPS                        970
#define RD7PPS0                       971
#define RD7PPS1                       972
#define RD7PPS2                       973
#define RD7PPS3                       974
#define RD7PPS4                       975
#define RD7PPS5                       976
#define RE0PPS                        977
#define RE0PPS0                       978
#define RE0PPS1                       979
#define RE0PPS2                       980
#define RE0PPS3                       981
#define RE0PPS4                       982
#define RE0PPS5                       983
#define RE1PPS                        984
#define RE1PPS0                       985
#define RE1PPS1                       986
#define RE1PPS2                       987
#define RE1PPS3                       988
#define RE1PPS4                       989
#define RE1PPS5                       990
#define RE2PPS                        991
#define RE2PPS0                       992
#define RE2PPS1                       993
#define RE2PPS2                       994
#define RE2PPS3                       995
#define RE2PPS4                       996
#define RE2PPS5                       997
#define RE3PPS                        998
#define RE3PPS0                       999
#define RE3PPS1                       1000
#define RE3PPS2                       1001
#define RE3PPS3                       1002
#define RE3PPS4                       1003
#define RE3PPS5                       1004
#define RE4PPS                        1005
#define RE4PPS0                       1006
#define RE4PPS1                       1007
#define RE4PPS2                       1008
#define RE4PPS3                       1009
#define RE4PPS4                       1010
#define RE4PPS5                       1011
#define RE5PPS                        1012
#define RE5PPS0                       1013
#define RE5PPS1                       1014
#define RE5PPS2                       1015
#define RE5PPS3                       1016
#define RE5PPS4                       1017
#define RE5PPS5                       1018
#define RE6PPS                        1019
#define RE6PPS0                       1020
#define RE6PPS1                       1021
#define RE6PPS2                       1022
#define RE6PPS3                       1023
#define RE6PPS4                       1024
#define RE6PPS5                       1025
#define RE7PPS                        1026
#define RE7PPS0                       1027
#define RE7PPS1                       1028
#define RE7PPS2                       1029
#define RE7PPS3                       1030
#define RE7PPS4                       1031
#define RE7PPS5                       1032
#define RF0PPS                        1033
#define RF0PPS0                       1034
#define RF0PPS1                       1035
#define RF0PPS2                       1036
#define RF0PPS3                       1037
#define RF0PPS4                       1038
#define RF0PPS5                       1039
#define RF1PPS                        1040
#define RF1PPS0                       1041
#define RF1PPS1                       1042
#define RF1PPS2                       1043
#define RF1PPS3                       1044
#define RF1PPS4                       1045
#define RF1PPS5                       1046
#define RF2PPS                        1047
#define RF2PPS0                       1048
#define RF2PPS1                       1049
#define RF2PPS2                       1050
#define RF2PPS3                       1051
#define RF2PPS4                       1052
#define RF2PPS5                       1053
#define RF3PPS                        1054
#define RF3PPS0                       1055
#define RF3PPS1                       1056
#define RF3PPS2                       1057
#define RF3PPS3                       1058
#define RF3PPS4                       1059
#define RF3PPS5                       1060
#define RF4PPS                        1061
#define RF4PPS0                       1062
#define RF4PPS1                       1063
#define RF4PPS2                       1064
#define RF4PPS3                       1065
#define RF4PPS4                       1066
#define RF4PPS5                       1067
#define RF5PPS                        1068
#define RF5PPS0                       1069
#define RF5PPS1                       1070
#define RF5PPS2                       1071
#define RF5PPS3                       1072
#define RF5PPS4                       1073
#define RF5PPS5                       1074
#define RF6PPS                        1075
#define RF6PPS0                       1076
#define RF6PPS1                       1077
#define RF6PPS2                       1078
#define RF6PPS3                       1079
#define RF6PPS4                       1080
#define RF6PPS5                       1081
#define RF7PPS                        1082
#define RF7PPS0                       1083
#define RF7PPS1                       1084
#define RF7PPS2                       1085
#define RF7PPS3                       1086
#define RF7PPS4                       1087
#define RF7PPS5                       1088
#define RG0PPS                        1089
#define RG0PPS0                       1090
